linux_program.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-22 Fr 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="sx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Linux Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org708967e">Makefile</a>
<ul>
<li><a href="#org4610414">格式</a></li>
<li><a href="#org0f62d0d">1example</a></li>
<li><a href="#orgdc11ddc">2修改后只编译改动后的文件</a></li>
<li><a href="#org1b9898b">3使用自动变量</a></li>
<li><a href="#org1f2cd5f">4增加可移植性</a></li>
<li><a href="#orgd00c42f">5清洁中间的生成的不必要保存文件</a></li>
</ul>
</li>
<li><a href="#org0f2ae61">静态库的制作</a>
<ul>
<li><a href="#orgf5d5388">库方</a></li>
<li><a href="#orgf51942f">甲方</a></li>
<li><a href="#org0e5cfa8">特点</a></li>
</ul>
</li>
<li><a href="#org966676b">动态库的制作</a>
<ul>
<li><a href="#orgdbcbcfa">环境变量</a></li>
<li><a href="#orgb6d5e4f">修改配置文件</a></li>
<li><a href="#orgd5d495e">通过函数加载</a></li>
</ul>
</li>
<li><a href="#orgcaffde9">exit</a></li>
<li><a href="#orgde56767">memory</a>
<ul>
<li><a href="#org020151c">memcpy</a></li>
</ul>
</li>
<li><a href="#org303c9f8">pipe</a>
<ul>
<li><a href="#org5f2b288">named pipe</a></li>
<li><a href="#org3610eb3">unnamed pipe</a></li>
</ul>
</li>
<li><a href="#org5eafb94">memset</a></li>
<li><a href="#org0e0369e">signa</a>
<ul>
<li><a href="#org1e736e9">kill</a></li>
<li><a href="#org4856943">raise</a></li>
<li><a href="#org5cf8964">alarm</a></li>
<li><a href="#org8f3753a">pause</a></li>
<li><a href="#org5a72597">signal</a></li>
</ul>
</li>
<li><a href="#org7e5f088">shared memory</a>
<ul>
<li><a href="#org1aaaac8">key</a></li>
<li><a href="#org12f556e">shmget</a></li>
<li><a href="#org256e5c2">shmat</a></li>
<li><a href="#org9eddfb6">shmdt</a></li>
<li><a href="#orgc11b544">shmctl</a></li>
<li><a href="#org7c892a1">IPC manipulation</a></li>
</ul>
</li>
<li><a href="#org0d72cca">message queue</a>
<ul>
<li><a href="#org5260535">msgget</a></li>
<li><a href="#orge68d7b4">msgctl</a></li>
<li><a href="#orga58a75c">msgsnd</a></li>
<li><a href="#org292614d">msgrcv</a></li>
</ul>
</li>
<li><a href="#orgb97be96">semaphore</a>
<ul>
<li><a href="#orgf060075">semget</a></li>
<li><a href="#org9f0dde3">semctl</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org708967e" class="outline-2">
<h2 id="org708967e">Makefile</h2>
<div class="outline-text-2" id="text-org708967e">
<p>
gcc 调用 make 来构造
</p>
</div>

<div id="outline-container-org4610414" class="outline-3">
<h3 id="org4610414">格式</h3>
<div class="outline-text-3" id="text-org4610414">
<p>
目标 ： 依赖
Tab 命令
</p>
</div>
</div>
<div id="outline-container-org0f62d0d" class="outline-3">
<h3 id="org0f62d0d">1example</h3>
<div class="outline-text-3" id="text-org0f62d0d">
<p>
实列文件：add.c  head.h   main.c   maul.c  sub.c  
直接在terminal 用gcc ：$ gcc add.c main.c sub.c -o app
</p>

<p>
Makefile :
$ touch Makefile
</p>
<div class="org-src-container">
<pre class="src src-txt">app: main.c add.c sub.c mul.c
    gcc main.c add.c sub.c mul.c 
</pre>
</div>
<p>
$ make
</p>
</div>
</div>

<div id="outline-container-orgdc11ddc" class="outline-3">
<h3 id="orgdc11ddc">2修改后只编译改动后的文件</h3>
<div class="outline-text-3" id="text-orgdc11ddc">
<p>
Makefile :
$ touch Makefile
</p>
<div class="org-src-container">
<pre class="src src-txt">app: main.o add.o sub.o mul.o
    gcc main.o add.o sub.o mul.o -o app

main.o: main.c
    gcc -c main.c -o main.o

add.o: add.c
    gcc -c add.c -o add.o

sub.o: sub.c
    gcc -c sub.c -o sub.o

mul.o: mul.c
    gcc -c mul.c -o mul.o

</pre>
</div>
<p>
$ make
所有源文件的修改过，即时间戳晚于生成的目标文件，则重新编译
</p>
</div>
</div>
<div id="outline-container-org1b9898b" class="outline-3">
<h3 id="org1b9898b">3使用自动变量</h3>
<div class="outline-text-3" id="text-org1b9898b">
<p>
$@ :目标
$&lt; :第一个依赖 
$^ :所有依赖
Makefile :
$ touch Makefile
</p>

<div class="org-src-container">
<pre class="src src-txt">obj =   main.o add.o sub.o mul.o
target = app

$(target):$(obj)
    gcc $(obj) -o $(target)  // gcc $^ -o $@

%.o:%.c
    gcc -c $&lt; -o $@

</pre>
</div>
<p>
$ make
</p>
</div>
</div>
<div id="outline-container-org1f2cd5f" class="outline-3">
<h3 id="org1f2cd5f">4增加可移植性</h3>
<div class="outline-text-3" id="text-org1f2cd5f">
<p>
wildcard :查找指定目录下的指定类型文件
src = $(wildcard ./*.c)
将当前目录下所有的.c 找到，并赋给src
</p>

<p>
patsubst :匹配替换
obj = $(patsubst %.c, %.o, $(src))
将src中的所有.c替换为.o
</p>

<p>
Makefile :
$ touch Makefile
</p>

<div class="org-src-container">
<pre class="src src-txt">src = $(wildcard ./*.c)
obj = $(patsubst %.c, %.o $(src))
target = app

$(target):$(obj)
    gcc $^ -o $@

%.o:%.c
    gcc -c $&lt; -o $@

</pre>
</div>
<p>
$ make
此文件在别的目录下也能使用
</p>
</div>
</div>
<div id="outline-container-orgd00c42f" class="outline-3">
<h3 id="orgd00c42f">5清洁中间的生成的不必要保存文件</h3>
<div class="outline-text-3" id="text-orgd00c42f">
<p>
make 一般直接执行终结目标，但是可以直接指定make的函数
clean : 删除不必要的文件，-f : 强制删除，不管有没有该文件，- : 前置-后，遇到错误执行，直接跳过
</p>

<div class="org-src-container">
<pre class="src src-txt">src = $(wildcard ./*.c)
obj = $(patsubst %.c, %.o $(src))
target = app

$(target):$(obj)
    gcc $^ -o $@

%.o:%.c
    gcc -c $&lt; -o $@

clean:
    rm $(obj) $(target)
    rm $(obj) $(target) -f
    -rm $(obj) $(target) -f

</pre>
</div>

<p>
$ make
$ make clean
</p>
</div>
</div>
</div>

<div id="outline-container-org0f2ae61" class="outline-2">
<h2 id="org0f2ae61">静态库的制作</h2>
<div class="outline-text-2" id="text-org0f2ae61">
</div>
<div id="outline-container-orgf5d5388" class="outline-3">
<h3 id="orgf5d5388">库方</h3>
<div class="outline-text-3" id="text-orgf5d5388">
<p>
include/head.h  lib/  src/
将在src/中编写要实现的文件
并编译这些文件             $ gcc *.c -c -I ../include/
-I :链接头文件
再将这些编译后的打包       $ ar rcs libtest.a *.o
ar : -archive 打包
检测 : nm libtest.a
前缀lib 和后缀.a 不能更改，实际名字是test
</p>

<p>
最后将生成的libtest.a放到上级目录lib中，
可以将lib和include目录发送给甲方
</p>
</div>
</div>
<div id="outline-container-orgf51942f" class="outline-3">
<h3 id="orgf51942f">甲方</h3>
<div class="outline-text-3" id="text-orgf51942f">
<p>
根据include/head.h 的头文件编写自己的应用文件main.c
编译main.c并链接头文件和库 
  $ gcc main.c -I  ./include/ -L ./lib/ -ltest -o app
-I : 连接头文件
-L : 链接库
-ltest : 链接库文件，去头lib 去尾.a
-o: 指点生成的应用名
</p>
</div>
</div>

<div id="outline-container-org0e5cfa8" class="outline-3">
<h3 id="org0e5cfa8">特点</h3>
<div class="outline-text-3" id="text-org0e5cfa8">
<p>
优点： 加载块，移植方便
缺点 ：部署更新麻烦，引用的重复文件重复储存，浪费空间
</p>
</div>
</div>
</div>

<div id="outline-container-org966676b" class="outline-2">
<h2 id="org966676b">动态库的制作</h2>
<div class="outline-text-2" id="text-org966676b">
<p>
编译    $ gcc *.c -c -fpic -I ../include
-fpic 或者 fPIC : 特殊命令
打包    $ gcc -shared *.o -o libxxx.so
头lib 尾.so 
</p>

<p>
使用和静态库相似， 根据头文件编写应用文件main.c
$ gcc main.c -I ./inculde/ -L ./lib/ -lxxx -o app
</p>

<p>
对于linux生成的文件都是elf格式，并由ld-libc.so动态加载,需要让app能别找
到可以用环境变量或者配置文件
</p>
</div>

<div id="outline-container-orgdbcbcfa" class="outline-3">
<h3 id="orgdbcbcfa">环境变量</h3>
<div class="outline-text-3" id="text-orgdbcbcfa">
<p>
临时设置   
  $ export LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib
或者新增   
  $ export LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib:LD<sub>LIBRARY</sub><sub>PATH</sub>
</p>

<p>
临时设置可以使用相对路径，
</p>

<p>
永久设置 用户
$ cat " LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib:LD<sub>LIBRARY</sub><sub>PATH</sub>" &gt;&gt; ~/.bashrc
$ source ~./bashrc
</p>

<p>
永久设置 系统
$ sudo cat "LD<sub>LIBRARY</sub><sub>PATH</sub>=./lib:LD<sub>LIBRARY</sub><sub>PATH</sub>" &gt;&gt; /etc/profile
$ source /etc/profile
</p>
</div>
</div>

<div id="outline-container-orgb6d5e4f" class="outline-3">
<h3 id="orgb6d5e4f">修改配置文件</h3>
<div class="outline-text-3" id="text-orgb6d5e4f">
<p>
配置文件/etc/ld.so.conf
$ sudo cat "绝对路径/lib" &gt;&gt; /etc/ld.so.conf
$ sudo ldconfig -v 激活配置
</p>
</div>
</div>

<div id="outline-container-orgd5d495e" class="outline-3">
<h3 id="orgd5d495e">通过函数加载</h3>
<div class="outline-text-3" id="text-orgd5d495e">
<p>
dlopen dlclose dlsym
</p>
</div>
</div>
</div>

<div id="outline-container-orgcaffde9" class="outline-2">
<h2 id="orgcaffde9">exit</h2>
<div class="outline-text-2" id="text-orgcaffde9">
<p>
exit(0) will also send signal 17 (SIGCHID) to its father thread;
</p>
</div>
</div>

<div id="outline-container-orgde56767" class="outline-2">
<h2 id="orgde56767">memory</h2>
<div class="outline-text-2" id="text-orgde56767">
</div>
<div id="outline-container-org020151c" class="outline-3">
<h3 id="org020151c">memcpy</h3>
<div class="outline-text-3" id="text-org020151c">
<p>
memcpy(p, "niao",4);
</p>
</div>
</div>
</div>
<div id="outline-container-org303c9f8" class="outline-2">
<h2 id="org303c9f8">pipe</h2>
<div class="outline-text-2" id="text-org303c9f8">
</div>
<div id="outline-container-org5f2b288" class="outline-3">
<h3 id="org5f2b288">named pipe</h3>
<div class="outline-text-3" id="text-org5f2b288">
<ol class="org-ol">
<li>In current directory:   mkfifo("./myfifo", 0777);</li>
</ol>
<p>
with mkfifo creat a file, so that other unrelated process can commu  
</p>

<ol class="org-ol">
<li>In one process : fd = open("./myfifo", O<sub>WRONGLY</sub>);</li>
</ol>
<p>
open the file,  and :
write(fd, &amp;process<sub>inter,1</sub>);
change the pipe variable.
</p>

<ol class="org-ol">
<li>In other process :   fd = open("./myfifo",O<sub>RDONLY</sub>);</li>
</ol>
<p>
open the file, and : while(process<sub>inter</sub> == 0);
can be controled by pipe variable 
</p>
</div>
</div>

<div id="outline-container-org3610eb3" class="outline-3">
<h3 id="org3610eb3">unnamed pipe</h3>
<div class="outline-text-3" id="text-org3610eb3">
<ol class="org-ol">
<li><p>
In one process diff threads
creat place for pipe : int fd[2]; one for main thread, one for new thread
creat pipe : int ret = pipe(fd);
</p>

<p>
in new thread : read(fd[0], &amp;process<sub>inter</sub> 1); if nothing to read, sleep
in main thread do its stuff, 
after finish : write(fd[1], &amp;process<sub>inter</sub>, 1); let new pthread run
</p>

<p>
remeber: wirte at frist in fd[1], and then read at fd[0]
</p></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5eafb94" class="outline-2">
<h2 id="org5eafb94">memset</h2>
</div>
<div id="outline-container-org0e0369e" class="outline-2">
<h2 id="org0e0369e">signa</h2>
<div class="outline-text-2" id="text-org0e0369e">
</div>
<div id="outline-container-org1e736e9" class="outline-3">
<h3 id="org1e736e9">kill</h3>
<div class="outline-text-3" id="text-org1e736e9">
<p>
kill(pid, 9);
send signal 9 to pid process
</p>
</div>
</div>
<div id="outline-container-org4856943" class="outline-3">
<h3 id="org4856943">raise</h3>
<div class="outline-text-3" id="text-org4856943">
<p>
raise(9);  == kill(getpid(), 9);
</p>
</div>
</div>
<div id="outline-container-org5cf8964" class="outline-3">
<h3 id="org5cf8964">alarm</h3>
<div class="outline-text-3" id="text-org5cf8964">
<p>
alarm(10);   wait for 10 seconds and kill itself
send signal as 14 to itself
</p>
</div>
</div>
<div id="outline-container-org8f3753a" class="outline-3">
<h3 id="org8f3753a">pause</h3>
<div class="outline-text-3" id="text-org8f3753a">
<p>
pause(); stoped for ever
</p>
</div>
</div>
<div id="outline-container-org5a72597" class="outline-3">
<h3 id="org5a72597">signal</h3>
<div class="outline-text-3" id="text-org5a72597">
<p>
signal(signal<sub>ID</sub>, self<sub>function</sub>); self function or SIG<sub>ING</sub> or SIG<sub>DFL</sub>
</p>
</div>
</div>
</div>

<div id="outline-container-org7e5f088" class="outline-2">
<h2 id="org7e5f088">shared memory</h2>
<div class="outline-text-2" id="text-org7e5f088">
</div>
<div id="outline-container-org1aaaac8" class="outline-3">
<h3 id="org1aaaac8">key</h3>
<div class="outline-text-3" id="text-org1aaaac8">
<p>
key can be 2 differ
</p>
<pre class="example">

1. For father and son process : IPC_PRIVATE : 
2. For unrelated process : self_def key
  int key;
  key = ftok("./a.c", 'a');
  if (key &lt; 0) {
    printf("create key for server failed \n");
    return -1;
  }
  printf("create key for server success \n");

</pre>
</div>
</div>
<div id="outline-container-org12f556e" class="outline-3">
<h3 id="org12f556e">shmget</h3>
<div class="outline-text-3" id="text-org12f556e">
<p>
shmid = shmget(IPC<sub>PRIVATE</sub>, 128, 0777);
shmid = shmget(key, 128, IPC<sub>CREAT</sub> | 0777);
</p>
</div>
</div>
<div id="outline-container-org256e5c2" class="outline-3">
<h3 id="org256e5c2">shmat</h3>
<div class="outline-text-3" id="text-org256e5c2">
<p>
char *p  = (char *) shmat(shmid, NULL, 0);
after mapping to p : can be manipulated
scanf("%s", p);
printf("%s", p);
</p>
</div>
</div>

<div id="outline-container-org9eddfb6" class="outline-3">
<h3 id="org9eddfb6">shmdt</h3>
<div class="outline-text-3" id="text-org9eddfb6">
<p>
delete the mapping of p to shared memory 
shmdt(p); 
after that, the manipulation of p is not allowed, and well be
segmention fault
</p>
</div>
</div>

<div id="outline-container-orgc11b544" class="outline-3">
<h3 id="orgc11b544">shmctl</h3>
<div class="outline-text-3" id="text-orgc11b544">
<p>
delete the created shared memory
shmctl(shmid, IPC<sub>RMID</sub>, NULL); == iprcm -m shmid
</p>
</div>
</div>

<div id="outline-container-org7c892a1" class="outline-3">
<h3 id="org7c892a1">IPC manipulation</h3>
<div class="outline-text-3" id="text-org7c892a1">
<p>
show : ipcs -m(shared memory) -q(message queue) -s(semaphores) 
delete : ipcrm -m shmid /-q msgid /-s semid
</p>
</div>
</div>
</div>

<div id="outline-container-org0d72cca" class="outline-2">
<h2 id="org0d72cca">message queue</h2>
<div class="outline-text-2" id="text-org0d72cca">
</div>
<div id="outline-container-org5260535" class="outline-3">
<h3 id="org5260535">msgget</h3>
<div class="outline-text-3" id="text-org5260535">
<p>
msgid= msgget(IPC<sub>PRIVATE</sub>, 0777);
</p>
</div>
</div>

<div id="outline-container-orge68d7b4" class="outline-3">
<h3 id="orge68d7b4">msgctl</h3>
<div class="outline-text-3" id="text-orge68d7b4">
<p>
msgctl(msgid, IPC<sub>RMID</sub>, NULL); == ipcrm -q msgid
</p>
</div>
</div>

<div id="outline-container-orga58a75c" class="outline-3">
<h3 id="orga58a75c">msgsnd</h3>
<div class="outline-text-3" id="text-orga58a75c">
<p>
msgsnd(msgid, (void *)&amp;sendbuffer, strlen(sendbuffer.message), 0);
</p>
</div>
</div>

<div id="outline-container-org292614d" class="outline-3">
<h3 id="org292614d">msgrcv</h3>
<div class="outline-text-3" id="text-org292614d">
<p>
receivelen = msgrcv(msgid, (void *)&amp;receiverbuffer, messagelen, 100, 0);
</p>
</div>
</div>
</div>

<div id="outline-container-orgb97be96" class="outline-2">
<h2 id="orgb97be96">semaphore</h2>
<div class="outline-text-2" id="text-orgb97be96">
</div>
<div id="outline-container-orgf060075" class="outline-3">
<h3 id="orgf060075">semget</h3>
<div class="outline-text-3" id="text-orgf060075">
<p>
semid = semget(IPC<sub>PRIVATE,3</sub> ,  0777);
</p>
</div>
</div>
<div id="outline-container-org9f0dde3" class="outline-3">
<h3 id="org9f0dde3">semctl</h3>
<div class="outline-text-3" id="text-org9f0dde3">
<p>
semctl(semid, 0, IPC<sub>RMID</sub>, NULL);
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: sx</p>
<p class="date">Created: 2020-05-22 Fr 19:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
